data_0 = ['Общая информация', 'Ссылки', 'Индексация', 'Ключевые фразы', 'Контент',
          'Проверки и тексты', 'Удобство для пользователей', 'Оптимизация']

data_0_5 = [0.89, 0.79, 0.95, 0.46, 0.76, 0.87, 0.23, 0.15]

data_1 = [
    ['Индексация в Google', 'Индексация в Яндекс', 'Наличие фильтров и санкций', 'Региональность сайта',
     'История сайта', 'История домена'],
    ['Полезная ссылочная масса', 'Вредоносные ссылки', 'Наличие сайта в основных справочниках',
     'Наличие сайта в Google Maps', 'Отзывы о компании в сети'],
    ['Файл robots.txt', 'Файл sitemap.xml', 'SSL сертификат на сайте', 'Зеркала сайта'],
    ['Скорость загрузки страниц сайта', 'Проверка на отсутствие вирусов и вредоносных скриптов',
     'Проверка корректности 404 страницы', 'Проверка удобства просмотра на мобильных устройствах',
     'Валидность HTML-кода', 'Проверка битых ссылок', 'Проверка доступности', 'Проверка скорости загрузки',
     'Проверка веса страниц'],
    ['Достаточность текстового контента', 'Графический контент', 'Пользовательский контент'],
    ['Тег title', 'Тег description', 'Тег keywords', 'Теги заголовков', 'URL страниц', 'Анализ на переспам',
     'Уникальность текстов', 'Кнопки социальных сетей', 'Перелинковка и хлебные крошки'],
    ['Семантическая разметка страниц', 'Наличие кейвордов в тегах', 'Наличие кейвордов в заголовках',
     'Наличие кейвордов в тексте'],
    ['Favicon', 'Адаптивность верстки сайта', 'Доступность всех страниц', 'Удобная навигация по сайту',
     'Поведенческие факторы']
]

data_1_5 = [
    [0.69, 0.79, 0.95, 0.46, 0.76, 0.87],
    [0.89, 0.79, 0.95, 0.46, 0.76],
    [0.89, 0.79, 0.95, 0.46],
    [0.89, 0.79, 0.95, 0.46, 0.76, 0.87, 0.23, 0.15, 0.74],
    [0.95, 0.46, 0.76],
    [0.89, 0.79, 0.95, 0.46, 0.76, 0.87, 0.23, 0.15, 0.74],
    [0.89, 0.79, 0.95, 0.46],
    [0.89, 0.79, 0.95, 0.46, 0.76]
]

data_1_6 = [
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ],
    ['От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.',
     'От того, как хорошо индексируется сайта в google напрямую зависит, будет ли он показываться на страницах '
     'поисковой системы Без корректной индексации сайта все прочая оптимизация и продвижение не имеют смысла.'
     ]
]
data_2 = [
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ],
    [
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы'],
        ['Длина не более 90 символов', 'Соответствие содержимому страницы', 'Отсутствие дублирования',
         'Наличие ключевых фраз', 'Корректное правописание', 'Лишние символы']
    ]

]

data_2_5 = [
    [
        [0.69, 0.78, 0.25, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.15, 0.78, 0.26, 0.37, 0.99, 0.19],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ],
    [
        [0.15, 0.78, 0.26, 0.37, 0.99, 0.19],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91],
        [0.69, 0.78, 0.45, 0.89, 0.99, 0.91]
    ]

]

data_2_6 = [  # важность
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ],
    [
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7],
        [1, 3, 4, 2, 9, 7]
    ]

]

data_2_7 = [  # время
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ],
    [
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000],
        [10, 60, 360, 1440, 3600, 12000]
    ]

]


def cat_count():
    return len(data_0)


def header_back(i):
    return data_0[i]


def header_value_back(i):
    return data_0_5[i]


def data_back(i):
    return data_1[i]


def data_value_back(i):
    return data_1_5[i]


def data_task_back(i):
    return data_1_6[i]


def params_back(i, j):
    return data_2[i][j]


def params_value_back(i, j):
    return data_2_5[i][j]


def params_importance_back(i, j):
    return data_2_6[i][j]


def params_time_back(i, j):
    return data_2_7[i][j]

# print(params_value_back(3, 4))
